package org.kly.algorithms.leetcode.easy;

import java.util.*;

/**
 * 给定两个数组，编写一个函数来计算它们的交集。
 * <p>
 *  
 * <p>
 * 示例 1：
 * <p>
 * 输入：nums1 = [1,2,2,1], nums2 = [2,2]
 * 输出：[2,2]
 * 示例 2:
 * <p>
 * 输入：nums1 = [4,9,5], nums2 = [9,4,9,8,4]
 * 输出：[4,9]
 *  
 * <p>
 * 说明：
 * <p>
 * 输出结果中每个元素出现的次数，应与元素在两个数组中出现次数的最小值一致。
 * 我们可以不考虑输出结果的顺序。
 * 进阶：
 * <p>
 * 如果给定的数组已经排好序呢？你将如何优化你的算法？
 * 如果 nums1 的大小比 nums2 小很多，哪种方法更优？
 * 如果 nums2 的元素存储在磁盘上，磁盘内存是有限的，并且你不能一次加载所有的元素到内存中，你该怎么办？
 * <p>
 * 来源：力扣（LeetCode）
 * 链接：https://leetcode-cn.com/problems/intersection-of-two-arrays-ii
 * 著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。
 *
 * @Author konglingyao
 * @Date 2020/7/13
 */
public class e_350_两个数组的交集_II {

    public static int[] intersect(int[] nums1, int[] nums2) {
        Map<Integer, Integer> resMap = new HashMap<>();
        List<Integer> res = new ArrayList<>();
        for (Integer i : nums1) {

            resMap.merge(i, 1, (k, v) -> ++k);
        }
        for (Integer j : nums2) {
            if (resMap.computeIfPresent(j, (k, v) -> v >= 1 ?  --v: null) != null) {
                res.add(j);
            }
        }
        int[] res1 = new int[res.size()];
        int i1 = 0;
        for (Integer i : res) {
            res1[i1] = i;
            i1++;
        }
        return res1;
    }

    /**
     * [21,47,80,4,3,24,87,12,22,11,48,6,89,80,74,71,74,55,58,56,4,98,40,66,49,53,62,27,3,66,78,24,48,69,88,12,80,63,98,65,46,35,72,5,64,72,7,29,37,3,2,75,44,93,79,78,13,39,85,26,15,41,87,47,29,93,41,74,6,48,17,89,27,61,2,68,99,57,45,73,25,33,38,32,58]
     * [1,39,6,81,85,10,38,22,0,89,57,93,58,69,65,80,84,24,27,54,37,36,26,88,2,7,24,36,51,5,74,57,45,56,55,67,25,33,78,49,16,79,74,80,36,27,89,49,64,73,96,60,92,31,98,72,22,31,0,93,70,87,80,66,75,69,81,52,94,90,51,90,74,36,58,38,50,9,64,55,4,21,49,60,65,47,67,8,38,83]
     *
     * [39,6,85,38,22,89,57,93,58,69,65,80,24,27,37,26,88,2,7,24,5,74,45,56,55,25,33,78,49,79,74,80,27,89,64,73,98,72,93,87,66,75,58,4]
     * [80,4,24,87,22,6,89,80,74,74,55,58,56,98,66,49,27,78,24,69,88,80,65,72,5,64,7,37,2,75,93,79,39,85,26,93,74,89,27,57,45,73,25,33,38,58]
     */
    public static void main(String[] args) {
        intersect(new int[]{4,9,5}
        , new int[]{4,9,4,9,8});
    }
}
